7767517
13 15
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Input                    in2                      0 1 in2
Gemm                     gemm_0                   1 1 in0 3 10=4 2=0 3=1 4=0 5=1 6=1 7=1 8=400 9=161
ReLU                     relu_4                   1 1 3 4
GRU                      gru_8                    2 2 4 in1 5 out1 0=400 1=480000 2=0
GRU                      gru_9                    2 2 5 in2 7 out2 0=400 1=480000 2=0
Gemm                     gemm_1                   1 1 7 9 10=4 2=0 3=1 4=0 5=1 6=1 7=1 8=600 9=400
ReLU                     relu_5                   1 1 9 10
Gemm                     gemm_2                   1 1 10 11 10=4 2=0 3=1 4=0 5=1 6=1 7=1 8=600 9=600
ReLU                     relu_6                   1 1 11 12
Gemm                     gemm_3                   1 1 12 13 10=4 2=0 3=1 4=0 5=1 6=1 7=1 8=161 9=600
Sigmoid                  sigmoid_7                1 1 13 out0
