7767517
338 428
Input                    in0                      0 1 in0
Permute                  permute_122              1 1 in0 1 0=1
ExpandDims               unsqueeze_192            1 1 1 2 -23303=1,0
Convolution              convrelu_0               1 1 2 3 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 9=1
Split                    splitncnn_0              1 2 3 4 5
Convolution              convclip_1               1 1 5 6 0=32 1=1 -23310=2,0.0,20.0 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=3
Slice                    split_0                  1 2 6 7 8 -23300=2,16,16 1=0
Convolution              convclip_2               1 1 7 9 0=16 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=3
Split                    splitncnn_1              1 2 9 10 11
BinaryOp                 add_0                    2 1 11 8 12 0=0
Convolution              convclip_3               1 1 12 13 0=16 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=3
Concat                   cat_0                    2 1 10 13 14 0=0
Convolution              conv_29                  1 1 14 15 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_30                  1 1 4 16 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
BinaryOp                 add_1                    2 1 15 16 17 0=0
Clip                     clamp_126                1 1 17 18 0=0.0 1=20.0
Split                    splitncnn_2              1 2 18 19 20
Convolution              convclip_4               1 1 20 21 0=32 1=1 -23310=2,0.0,20.0 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=3
Slice                    split_1                  1 2 21 22 23 -23300=2,16,16 1=0
Convolution              convclip_5               1 1 22 24 0=16 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=3
Split                    splitncnn_3              1 2 24 25 26
BinaryOp                 add_2                    2 1 26 23 27 0=0
Convolution              convclip_6               1 1 27 28 0=16 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=3
Concat                   cat_1                    2 1 25 28 29 0=0
Convolution              conv_34                  1 1 29 30 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
BinaryOp                 add_3                    2 1 30 19 31 0=0
Clip                     clamp_130                1 1 31 32 0=0.0 1=20.0
Split                    splitncnn_4              1 2 32 33 34
Convolution              convclip_7               1 1 34 35 0=32 1=1 -23310=2,0.0,20.0 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=3
Slice                    split_2                  1 2 35 36 37 -23300=2,16,16 1=0
Convolution              convclip_8               1 1 36 38 0=16 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=3
Split                    splitncnn_5              1 2 38 39 40
BinaryOp                 add_4                    2 1 40 37 41 0=0
Convolution              convclip_9               1 1 41 42 0=16 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=3
Concat                   cat_2                    2 1 39 42 43 0=0
Convolution              conv_38                  1 1 43 44 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
BinaryOp                 add_5                    2 1 44 33 45 0=0
Clip                     clamp_134                1 1 45 46 0=0.0 1=20.0
Split                    splitncnn_6              1 3 46 47 48 49
Convolution              convclip_10              1 1 49 50 0=64 1=1 -23310=2,0.0,20.0 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=4096 9=3
Slice                    split_3                  1 2 50 51 52 -23300=2,32,32 1=0
Convolution              convclip_11              1 1 51 53 0=32 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
Split                    splitncnn_7              1 2 53 54 55
BinaryOp                 add_6                    2 1 55 52 56 0=0
Convolution              convclip_12              1 1 56 57 0=32 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
Concat                   cat_3                    2 1 54 57 58 0=0
Convolution              conv_42                  1 1 58 59 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_43                  1 1 48 60 0=128 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=8192
BinaryOp                 add_7                    2 1 59 60 61 0=0
Clip                     clamp_138                1 1 61 62 0=0.0 1=20.0
Split                    splitncnn_8              1 2 62 63 64
Convolution              convclip_13              1 1 64 65 0=64 1=1 -23310=2,0.0,20.0 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=3
Slice                    split_4                  1 2 65 66 67 -23300=2,32,32 1=0
Convolution              convclip_14              1 1 66 68 0=32 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
Split                    splitncnn_9              1 2 68 69 70
BinaryOp                 add_8                    2 1 70 67 71 0=0
Convolution              convclip_15              1 1 71 72 0=32 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
Concat                   cat_4                    2 1 69 72 73 0=0
Convolution              conv_47                  1 1 73 74 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_9                    2 1 74 63 75 0=0
Clip                     clamp_142                1 1 75 76 0=0.0 1=20.0
Split                    splitncnn_10             1 2 76 77 78
Convolution              convclip_16              1 1 78 79 0=64 1=1 -23310=2,0.0,20.0 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=3
Slice                    split_5                  1 2 79 80 81 -23300=2,32,32 1=0
Convolution              convclip_17              1 1 80 82 0=32 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
Split                    splitncnn_11             1 2 82 83 84
BinaryOp                 add_10                   2 1 84 81 85 0=0
Convolution              convclip_18              1 1 85 86 0=32 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
Concat                   cat_5                    2 1 83 86 87 0=0
Convolution              conv_51                  1 1 87 88 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_11                   2 1 88 77 89 0=0
Clip                     clamp_146                1 1 89 90 0=0.0 1=20.0
Split                    splitncnn_12             1 2 90 91 92
Convolution              convclip_19              1 1 92 93 0=64 1=1 -23310=2,0.0,20.0 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=3
Slice                    split_6                  1 2 93 94 95 -23300=2,32,32 1=0
Convolution              convclip_20              1 1 94 96 0=32 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
Split                    splitncnn_13             1 2 96 97 98
BinaryOp                 add_12                   2 1 98 95 99 0=0
Convolution              convclip_21              1 1 99 100 0=32 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
Concat                   cat_6                    2 1 97 100 101 0=0
Convolution              conv_55                  1 1 101 102 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_13                   2 1 102 91 103 0=0
Clip                     clamp_150                1 1 103 104 0=0.0 1=20.0
Split                    splitncnn_14             1 4 104 105 106 107 108
Convolution              conv_56                  1 1 47 109 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=0 6=73728
Split                    splitncnn_15             1 2 109 110 111
Concat                   cat_7                    2 1 105 110 112 0=0
Convolution              conv_57                  1 1 112 113 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_1                   1 1 113 114
Convolution              conv_58                  1 1 114 115 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
TanH                     tanh_13                  1 1 115 116
BinaryOp                 add_14                   1 1 116 117 0=0 1=1 2=1.0
Split                    splitncnn_16             1 2 117 118 119
BinaryOp                 sub_15                   1 1 118 120 0=7 1=1 2=2.0
BinaryOp                 mul_16                   2 1 111 120 121 0=2
BinaryOp                 mul_17                   2 1 106 119 122 0=2
BinaryOp                 add_18                   2 1 122 121 123 0=0
Convolution              convclip_22              1 1 108 124 0=128 1=1 -23310=2,0.0,20.0 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=16384 9=3
Slice                    split_7                  1 2 124 125 126 -23300=2,64,64 1=0
Split                    splitncnn_17             1 2 126 127 128
Convolution              convclip_23              1 1 125 129 0=64 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Split                    splitncnn_18             1 3 129 130 131 132
Concat                   cat_8                    2 1 130 127 133 0=0
Convolution              conv_61                  1 1 133 134 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_2                   1 1 134 135
Convolution              conv_62                  1 1 135 136 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
TanH                     tanh_14                  1 1 136 137
BinaryOp                 add_19                   1 1 137 138 0=0 1=1 2=1.0
Split                    splitncnn_19             1 2 138 139 140
BinaryOp                 sub_20                   1 1 139 141 0=7 1=1 2=2.0
BinaryOp                 mul_21                   2 1 128 141 142 0=2
BinaryOp                 mul_22                   2 1 132 140 143 0=2
BinaryOp                 add_23                   2 1 143 142 144 0=0
Convolution              convclip_24              1 1 144 145 0=64 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Concat                   cat_9                    2 1 131 145 146 0=0
Convolution              conv_64                  1 1 146 147 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_65                  1 1 107 148 0=256 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=32768
BinaryOp                 add_24                   2 1 147 148 149 0=0
Clip                     clamp_154                1 1 149 150 0=0.0 1=20.0
Split                    splitncnn_20             1 2 150 151 152
Convolution              convclip_25              1 1 152 153 0=128 1=1 -23310=2,0.0,20.0 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=3
Slice                    split_8                  1 2 153 154 155 -23300=2,64,64 1=0
Split                    splitncnn_21             1 2 155 156 157
Convolution              convclip_26              1 1 154 158 0=64 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Split                    splitncnn_22             1 3 158 159 160 161
Concat                   cat_10                   2 1 159 156 162 0=0
Convolution              conv_68                  1 1 162 163 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_3                   1 1 163 164
Convolution              conv_69                  1 1 164 165 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
TanH                     tanh_15                  1 1 165 166
BinaryOp                 add_25                   1 1 166 167 0=0 1=1 2=1.0
Split                    splitncnn_23             1 2 167 168 169
BinaryOp                 sub_26                   1 1 168 170 0=7 1=1 2=2.0
BinaryOp                 mul_27                   2 1 157 170 171 0=2
BinaryOp                 mul_28                   2 1 161 169 172 0=2
BinaryOp                 add_29                   2 1 172 171 173 0=0
Convolution              convclip_27              1 1 173 174 0=64 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Concat                   cat_11                   2 1 160 174 175 0=0
Convolution              conv_71                  1 1 175 176 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_30                   2 1 176 151 177 0=0
Clip                     clamp_158                1 1 177 178 0=0.0 1=20.0
Split                    splitncnn_24             1 2 178 179 180
Convolution              convclip_28              1 1 180 181 0=128 1=1 -23310=2,0.0,20.0 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=3
Slice                    split_9                  1 2 181 182 183 -23300=2,64,64 1=0
Split                    splitncnn_25             1 2 183 184 185
Convolution              convclip_29              1 1 182 186 0=64 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Split                    splitncnn_26             1 3 186 187 188 189
Concat                   cat_12                   2 1 187 184 190 0=0
Convolution              conv_74                  1 1 190 191 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_4                   1 1 191 192
Convolution              conv_75                  1 1 192 193 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
TanH                     tanh_16                  1 1 193 194
BinaryOp                 add_31                   1 1 194 195 0=0 1=1 2=1.0
Split                    splitncnn_27             1 2 195 196 197
BinaryOp                 sub_32                   1 1 196 198 0=7 1=1 2=2.0
BinaryOp                 mul_33                   2 1 185 198 199 0=2
BinaryOp                 mul_34                   2 1 189 197 200 0=2
BinaryOp                 add_35                   2 1 200 199 201 0=0
Convolution              convclip_30              1 1 201 202 0=64 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Concat                   cat_13                   2 1 188 202 203 0=0
Convolution              conv_77                  1 1 203 204 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_36                   2 1 204 179 205 0=0
Clip                     clamp_162                1 1 205 206 0=0.0 1=20.0
Split                    splitncnn_28             1 2 206 207 208
Convolution              convclip_31              1 1 208 209 0=128 1=1 -23310=2,0.0,20.0 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=3
Slice                    split_10                 1 2 209 210 211 -23300=2,64,64 1=0
Split                    splitncnn_29             1 2 211 212 213
Convolution              convclip_32              1 1 210 214 0=64 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Split                    splitncnn_30             1 3 214 215 216 217
Concat                   cat_14                   2 1 215 212 218 0=0
Convolution              conv_80                  1 1 218 219 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_5                   1 1 219 220
Convolution              conv_81                  1 1 220 221 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
TanH                     tanh_17                  1 1 221 222
BinaryOp                 add_37                   1 1 222 223 0=0 1=1 2=1.0
Split                    splitncnn_31             1 2 223 224 225
BinaryOp                 sub_38                   1 1 224 226 0=7 1=1 2=2.0
BinaryOp                 mul_39                   2 1 213 226 227 0=2
BinaryOp                 mul_40                   2 1 217 225 228 0=2
BinaryOp                 add_41                   2 1 228 227 229 0=0
Convolution              convclip_33              1 1 229 230 0=64 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Concat                   cat_15                   2 1 216 230 231 0=0
Convolution              conv_83                  1 1 231 232 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_42                   2 1 232 207 233 0=0
Clip                     clamp_166                1 1 233 234 0=0.0 1=20.0
Split                    splitncnn_32             1 2 234 235 236
Convolution              convclip_34              1 1 236 237 0=128 1=1 -23310=2,0.0,20.0 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=3
Slice                    split_11                 1 2 237 238 239 -23300=2,64,64 1=0
Split                    splitncnn_33             1 2 239 240 241
Convolution              convclip_35              1 1 238 242 0=64 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Split                    splitncnn_34             1 3 242 243 244 245
Concat                   cat_16                   2 1 243 240 246 0=0
Convolution              conv_86                  1 1 246 247 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_6                   1 1 247 248
Convolution              conv_87                  1 1 248 249 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
TanH                     tanh_18                  1 1 249 250
BinaryOp                 add_43                   1 1 250 251 0=0 1=1 2=1.0
Split                    splitncnn_35             1 2 251 252 253
BinaryOp                 sub_44                   1 1 252 254 0=7 1=1 2=2.0
BinaryOp                 mul_45                   2 1 241 254 255 0=2
BinaryOp                 mul_46                   2 1 245 253 256 0=2
BinaryOp                 add_47                   2 1 256 255 257 0=0
Convolution              convclip_36              1 1 257 258 0=64 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Concat                   cat_17                   2 1 244 258 259 0=0
Convolution              conv_89                  1 1 259 260 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_48                   2 1 260 235 261 0=0
Clip                     clamp_170                1 1 261 262 0=0.0 1=20.0
Split                    splitncnn_36             1 2 262 263 264
Convolution              convclip_37              1 1 264 265 0=128 1=1 -23310=2,0.0,20.0 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=3
Slice                    split_12                 1 2 265 266 267 -23300=2,64,64 1=0
Split                    splitncnn_37             1 2 267 268 269
Convolution              convclip_38              1 1 266 270 0=64 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Split                    splitncnn_38             1 3 270 271 272 273
Concat                   cat_18                   2 1 271 268 274 0=0
Convolution              conv_92                  1 1 274 275 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_7                   1 1 275 276
Convolution              conv_93                  1 1 276 277 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
TanH                     tanh_19                  1 1 277 278
BinaryOp                 add_49                   1 1 278 279 0=0 1=1 2=1.0
Split                    splitncnn_39             1 2 279 280 281
BinaryOp                 sub_50                   1 1 280 282 0=7 1=1 2=2.0
BinaryOp                 mul_51                   2 1 269 282 283 0=2
BinaryOp                 mul_52                   2 1 273 281 284 0=2
BinaryOp                 add_53                   2 1 284 283 285 0=0
Convolution              convclip_39              1 1 285 286 0=64 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Concat                   cat_19                   2 1 272 286 287 0=0
Convolution              conv_95                  1 1 287 288 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_54                   2 1 288 263 289 0=0
Clip                     clamp_174                1 1 289 290 0=0.0 1=20.0
Split                    splitncnn_40             1 4 290 291 292 293 294
Convolution              conv_96                  1 1 123 295 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=0 6=294912
Split                    splitncnn_41             1 2 295 296 297
Concat                   cat_20                   2 1 291 296 298 0=0
Convolution              conv_97                  1 1 298 299 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_8                   1 1 299 300
Convolution              conv_98                  1 1 300 301 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
TanH                     tanh_20                  1 1 301 302
BinaryOp                 add_55                   1 1 302 303 0=0 1=1 2=1.0
Split                    splitncnn_42             1 2 303 304 305
BinaryOp                 sub_56                   1 1 304 306 0=7 1=1 2=2.0
BinaryOp                 mul_57                   2 1 297 306 307 0=2
BinaryOp                 mul_58                   2 1 292 305 308 0=2
BinaryOp                 add_59                   2 1 308 307 309 0=0
Convolution              convclip_40              1 1 294 310 0=256 1=1 -23310=2,0.0,20.0 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=65536 9=3
Slice                    split_13                 1 2 310 311 312 -23300=2,128,128 1=0
Split                    splitncnn_43             1 2 312 313 314
Convolution              convclip_41              1 1 311 315 0=128 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=3
Split                    splitncnn_44             1 3 315 316 317 318
Concat                   cat_21                   2 1 316 313 319 0=0
Convolution              conv_101                 1 1 319 320 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_9                   1 1 320 321
Convolution              conv_102                 1 1 321 322 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
TanH                     tanh_21                  1 1 322 323
BinaryOp                 add_60                   1 1 323 324 0=0 1=1 2=1.0
Split                    splitncnn_45             1 2 324 325 326
BinaryOp                 sub_61                   1 1 325 327 0=7 1=1 2=2.0
BinaryOp                 mul_62                   2 1 314 327 328 0=2
BinaryOp                 mul_63                   2 1 318 326 329 0=2
BinaryOp                 add_64                   2 1 329 328 330 0=0
Convolution              convclip_42              1 1 330 331 0=128 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=3
Concat                   cat_22                   2 1 317 331 332 0=0
Convolution              conv_104                 1 1 332 333 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Convolution              conv_105                 1 1 293 334 0=512 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=131072
BinaryOp                 add_65                   2 1 333 334 335 0=0
Clip                     clamp_178                1 1 335 336 0=0.0 1=20.0
Split                    splitncnn_46             1 2 336 337 338
Convolution              convclip_43              1 1 338 339 0=256 1=1 -23310=2,0.0,20.0 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=3
Slice                    split_14                 1 2 339 340 341 -23300=2,128,128 1=0
Split                    splitncnn_47             1 2 341 342 343
Convolution              convclip_44              1 1 340 344 0=128 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=3
Split                    splitncnn_48             1 3 344 345 346 347
Concat                   cat_23                   2 1 345 342 348 0=0
Convolution              conv_108                 1 1 348 349 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_10                  1 1 349 350
Convolution              conv_109                 1 1 350 351 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
TanH                     tanh_22                  1 1 351 352
BinaryOp                 add_66                   1 1 352 353 0=0 1=1 2=1.0
Split                    splitncnn_49             1 2 353 354 355
BinaryOp                 sub_67                   1 1 354 356 0=7 1=1 2=2.0
BinaryOp                 mul_68                   2 1 343 356 357 0=2
BinaryOp                 mul_69                   2 1 347 355 358 0=2
BinaryOp                 add_70                   2 1 358 357 359 0=0
Convolution              convclip_45              1 1 359 360 0=128 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=3
Concat                   cat_24                   2 1 346 360 361 0=0
Convolution              conv_111                 1 1 361 362 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_71                   2 1 362 337 363 0=0
Clip                     clamp_182                1 1 363 364 0=0.0 1=20.0
Split                    splitncnn_50             1 2 364 365 366
Convolution              convclip_46              1 1 366 367 0=256 1=1 -23310=2,0.0,20.0 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=3
Slice                    split_15                 1 2 367 368 369 -23300=2,128,128 1=0
Split                    splitncnn_51             1 2 369 370 371
Convolution              convclip_47              1 1 368 372 0=128 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=3
Split                    splitncnn_52             1 3 372 373 374 375
Concat                   cat_25                   2 1 373 370 376 0=0
Convolution              conv_114                 1 1 376 377 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_11                  1 1 377 378
Convolution              conv_115                 1 1 378 379 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
TanH                     tanh_23                  1 1 379 380
BinaryOp                 add_72                   1 1 380 381 0=0 1=1 2=1.0
Split                    splitncnn_53             1 2 381 382 383
BinaryOp                 sub_73                   1 1 382 384 0=7 1=1 2=2.0
BinaryOp                 mul_74                   2 1 371 384 385 0=2
BinaryOp                 mul_75                   2 1 375 383 386 0=2
BinaryOp                 add_76                   2 1 386 385 387 0=0
Convolution              convclip_48              1 1 387 388 0=128 1=3 -23310=2,0.0,20.0 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=3
Concat                   cat_26                   2 1 374 388 389 0=0
Convolution              conv_117                 1 1 389 390 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_77                   2 1 390 365 391 0=0
Clip                     clamp_186                1 1 391 392 0=0.0 1=20.0
Split                    splitncnn_54             1 2 392 393 394
Convolution              conv_118                 1 1 309 395 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=0 6=1179648
Split                    splitncnn_55             1 2 395 396 397
Concat                   cat_27                   2 1 393 396 398 0=0
Convolution              conv_119                 1 1 398 399 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_12                  1 1 399 400
Convolution              conv_120                 1 1 400 401 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
TanH                     tanh_24                  1 1 401 402
BinaryOp                 add_78                   1 1 402 403 0=0 1=1 2=1.0
Split                    splitncnn_56             1 2 403 404 405
BinaryOp                 sub_79                   1 1 404 406 0=7 1=1 2=2.0
BinaryOp                 mul_80                   2 1 397 406 407 0=2
BinaryOp                 mul_81                   2 1 394 405 408 0=2
BinaryOp                 add_82                   2 1 408 407 409 0=0
Split                    splitncnn_57             1 3 409 410 411 412
Reduction                mean_189                 1 1 412 413 0=3 1=0 -23303=1,-1 4=0 5=1
Reduction                mean_190                 1 1 411 414 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 sub_83                   2 1 410 414 415 0=1
Split                    splitncnn_58             1 2 415 416 417
BinaryOp                 mul_84                   2 1 416 417 418 0=2
Reduction                mean_191                 1 1 418 419 0=3 1=0 -23303=1,-1 4=0 5=1
BinaryOp                 mul_85                   1 1 419 420 0=2 1=1 2=5.0
BinaryOp                 div_86                   1 1 420 421 0=3 1=1 2=4.0
BinaryOp                 add_87                   1 1 421 422 0=0 1=1 2=1.000000e-08
UnaryOp                  sqrt_88                  1 1 422 423 0=5
Flatten                  flatten_187              1 1 413 424
Flatten                  flatten_188              1 1 423 425
Concat                   cat_28                   2 1 424 425 426 0=0
InnerProduct             linear_121               1 1 426 out0 0=512 1=1 2=5242880
